## 넘파이 패키지 이용하기
* 넘파이(Numpy)
* 배열 또는 벡터 계산을 위한 패키지
* ndarray 자료형을 이용

* 배열생성: arr=np.random.randint([5,8]) #어레이, 렌딘트
* 배열 연산: 일반 연산자 이용
* 단 행렬곱은 *(성분곱)대신 arr1.dot(arr2) 이용

## 넘파이 인덱싱, 슬라이싱

* arr 변수에 array([1,2,3,6,5,4])가 있다고 가정할 때
* arr[-2]==array([5])
* arr[3:]==array([6,5,4])

* 리스트 형태의 인덱싱과 슬라이싱이 가능

## 넘파이 파일 처리

* np.save('filename.npy', arr)
* arr=np.load('filename.npy') #로드 함수

* 저장된 파일은 바이너리 형식이므로,
* 판다스의 csv 등의 테이블 파일 저장에 비해 경제적

In [3]:
import numpy as np #기본

In [5]:
arr = np.array([1,2,3,4,5,6]) #넘파이 배열

In [6]:
arr[-6:-1] #슬라이싱하면 에러가 뜨지 않는다

array([1, 2, 3, 4, 5])

In [7]:
arr[-8:-1]

array([1, 2, 3, 4, 5])

In [8]:
arr[:99]

array([1, 2, 3, 4, 5, 6])

In [9]:
arr[99] #인덱싱하면 인덱스에러가 뜬다

IndexError: index 99 is out of bounds for axis 0 with size 6

In [21]:
arr

array([1, 2, 3, 4, 5, 6])

In [10]:
arr[-999:99]==arr

array([ True,  True,  True,  True,  True,  True])

In [12]:
[1,2,3]==[1,2,3]

True

In [22]:
list1 = [1,2,3]

In [23]:
list1[:] == list1

True

In [24]:
list(arr[-999:99])

[1, 2, 3, 4, 5, 6]

In [28]:
np.random.randint([5,8])

array([0, 5])

## 실습-주사위게임만들기
* numpy패키지를 이용해 주사위 게임 만들기
1. 컴퓨터는 두 숫자를 랜덤하게 받아낸다
2. 두 숫자는 육면체 주사위 눈의 그것과 같다
3. 처음에는 사용자에게 값을 알려주지 않고, 첫 번째 주사위가 두 번째 주사위 눈보다 큰지 물어본다
4. 사용자에게 큰지 작은지 응답을 받고, 맞췄는지 출력해준다
5. 해당 프로세스를 반복해서 할 수 있도록 한다(입력에 따라 종료할 수 있게 한다)

In [41]:
np.array([[1,2,3],[4,5,6],[7,8,9]]) #자동적으로 이차원으로 정렬됨

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [42]:
print(np.array([[1,2,3],[4,5,6],[7,8,9]])) #자동적으로 이차원으로 정렬됨

[[1 2 3]
 [4 5 6]
 [7 8 9]]

In [47]:
arr_2d=np.array([[1,2,3],[4,5,6],[7,8,9]])

In [48]:
arr_2d

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [49]:
arr_2d[1]

array([4, 5, 6])

In [53]:
arr_2d[2,2]

9

In [54]:
arr_2d[:2,2]

array([3, 6])

In [62]:
import pandas as pd

In [74]:
titanic=pd.read_csv("C:/Users/user/Desktop/신입강의/data/test.csv")

In [75]:
titanic

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [82]:
titanic_small = titanic[['Age', 'SibSp', 'Parch']].iloc[:10]

In [83]:
titanic_small

    Age  SibSp  Parch
0  34.5      0      0
1  47.0      1      0
2  62.0      0      0
3  27.0      0      0
4  22.0      1      1
5  14.0      0      0
6  30.0      0      0
7  26.0      1      1
8  18.0      0      0
9  21.0      2      0

In [86]:
import numpy as np

In [87]:
titanic_array=np.array(titanic_small)

In [88]:
titanic_array

array([[34.5,  0. ,  0. ],
       [47. ,  1. ,  0. ],
       [62. ,  0. ,  0. ],
       [27. ,  0. ,  0. ],
       [22. ,  1. ,  1. ],
       [14. ,  0. ,  0. ],
       [30. ,  0. ,  0. ],
       [26. ,  1. ,  1. ],
       [18. ,  0. ,  0. ],
       [21. ,  2. ,  0. ]])

In [91]:
np.save('./df_to_array.npy', titanic_array)

In [92]:
titanic_array_load=np.load('./df_to_array.npy')

In [93]:
titanic_array_load==titanic_array

array([[ True,  True,  True],
       [ True,  True,  True],
       [ True,  True,  True],
       [ True,  True,  True],
       [ True,  True,  True],
       [ True,  True,  True],
       [ True,  True,  True],
       [ True,  True,  True],
       [ True,  True,  True],
       [ True,  True,  True]])

In [94]:
titanic

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

## 판다스와 넘파이를 이용한 데이터 이용
* 주어진 데이터프레임에서 아래 처리를 한다
* 뒤에서 3번째 순서의 column을 df_to_arr 파일로 저장(바이너리 파일로)
* 임의의 범위를 슬라이싱한 뒤, 넘파이를 이용해 행렬곱 구하기

In [110]:
to_file=np.array(titanic['Fare'])

In [111]:
np.save('df_to_arr.npy',to_file)

In [112]:
titanic_small = titanic[['Age', 'SibSp', 'Parch']].iloc[:10]

In [117]:
array_dot1=titanic_small.iloc[:3]

In [125]:
array_dot2=titanic_small.iloc[-3:]

In [126]:
array_dot1=np.array(array_dot1)
array_dot2=np.array(array_dot2)

In [127]:
array_dot1.dot(array_dot2)

array([[ 897. ,   34.5,   34.5],
       [1240. ,   47. ,   47. ],
       [1612. ,   62. ,   62. ]])

In [129]:
titanic.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [130]:
titanic[['Age', 'SibSp', 'Parch']]

      Age  SibSp  Parch
0    34.5      0      0
1    47.0      1      0
2    62.0      0      0
3    27.0      0      0
4    22.0      1      1
..    ...    ...    ...
413   NaN      0      0
414  39.0      0      0
415  38.5      0      0
416   NaN      0      0
417   NaN      1      1

[418 rows x 3 columns]

In [ ]:
dict_indexing={'Passengerld':[0], 'Pclass':[0], 'Name':[0], 'Sex':[0], 'Age':[0], 'SibSp':[0], 'Parch':[0]}

ValueError: Length mismatch: Expected axis has 10 elements, new values have 3 elements

In [132]:
titanic_array

array([[34.5,  0. ,  0. ],
       [47. ,  1. ,  0. ],
       [62. ,  0. ,  0. ],
       [27. ,  0. ,  0. ],
       [22. ,  1. ,  1. ],
       [14. ,  0. ,  0. ],
       [30. ,  0. ,  0. ],
       [26. ,  1. ,  1. ],
       [18. ,  0. ,  0. ],
       [21. ,  2. ,  0. ]])

In [134]:
titanic_small.reset_index(drop=True)

    Age  SibSp  Parch
0  34.5      0      0
1  47.0      1      0
2  62.0      0      0
3  27.0      0      0
4  22.0      1      1
5  14.0      0      0
6  30.0      0      0
7  26.0      1      1
8  18.0      0      0
9  21.0      2      0

In [136]:
titanic_small.T

          0     1     2     3     4     5     6     7     8     9
Age    34.5  47.0  62.0  27.0  22.0  14.0  30.0  26.0  18.0  21.0
SibSp   0.0   1.0   0.0   0.0   1.0   0.0   0.0   1.0   0.0   2.0
Parch   0.0   0.0   0.0   0.0   1.0   0.0   0.0   1.0   0.0   0.0

In [137]:
titanic_array

array([[34.5,  0. ,  0. ],
       [47. ,  1. ,  0. ],
       [62. ,  0. ,  0. ],
       [27. ,  0. ,  0. ],
       [22. ,  1. ,  1. ],
       [14. ,  0. ,  0. ],
       [30. ,  0. ,  0. ],
       [26. ,  1. ,  1. ],
       [18. ,  0. ,  0. ],
       [21. ,  2. ,  0. ]])

In [138]:
ind=['hello','hi']
f'list:{ind} 2elelements'

"list:['hello', 'hi'] 2elelements"

## 복습

In [139]:
for i in range (10):
    print('i')

i
i
i
i
i
i
i
i
i
i

In [140]:
for i in range(len(titanic_small.idex)):
    print(titanic_small.iloc[i,1])

AttributeError: 'DataFrame' object has no attribute 'idex'

In [143]:
i=0
While True:
    print(i)
    i+=1
    
    if i>= 10:
        break

SyntaxError: invalid syntax (1857034652.py, line 2)

In [144]:
def func1():
    import math
    
    print(math.log(4))
    print(math.log(4))
    print(math.log(4))

In [145]:
func1()

1.3862943611198906
1.3862943611198906
1.3862943611198906

In [146]:
math.log(2)

NameError: name 'math' is not defined

In [147]:
print=789.99

In [148]:
print('hello')

TypeError: 'float' object is not callable

In [156]:
1+1 #plus()함수로 구현해보기

2

In [157]:
list1=[1,2,3]

In [158]:
list2=[1,2,3,4,5]

In [159]:
list1.append(4)

In [160]:
list1.append(5)

In [161]:
list1 #append2()라는 함수를 만들어 구현해보기

[1, 2, 3, 4, 5]

In [162]:
list2.append(4)